[
    {
        "id": 1,
        "name": "iPhone 14",
        "brand": "Apple",
        "description": "The iPhone 14 Mini seems to be all ready to entice its customers with captivating images and an outstanding camera system that is installed into the device",
        "price": 100.510231458
    },
    {
        "id": 2,
        "name": "samsung galaxy S23",
        "brand": "samsung",
        "description": "The S23 Ultra offers Samsung Galaxy's most advanced camera system, tailored for nearly any lighting conditions and engineered to render incredible details. Improved Nightography capabilities transform how the Galaxy S23 series optimises photos and videos in a wide range of ambient conditions.",
        "price": 898.1519999995151
    },
    {
        "id": 3,
        "name": "sony WH-1000XM5 headphones",
        "brand": "sony",
        "description": "These lightweight headphones are beautifully finished in newly developed soft fit leather. This material fits snugly around the head with less pressure on the ears while keeping out external sounds. Our noiseless design with stepless slider, seamless swivel and hanger makes WH-1000XM5 a pleasure to wear.",
        "price": 349.812054789999
    },
    {
        "id": 4,
        "name": "apple macBook pro",
        "brand": "apple",
        "description": "Apple MacBook Pro is a macOS laptop with a 13.30-inch display that has a resolution of 2560x1600 pixels. It is powered by a Core i5 processor and it comes with 12GB of RAM. The Apple MacBook Pro packs 512GB of SSD storage.",
        "price": 2000.999
    },
    {
        "id": 5,
        "name": "Amazon Echo Dot (5th Gen)",
        "brand": "amazon",
        "description": "5th (Latest) Generation Echo Dot with Alexa-The best sounding Echo Dot yet! With deeper bass and clearer vocals than all previous generations. Automatically turn on light when you enter the room or switch on the AC when it gets hot using in-built motion detection and temperature sensor.",
        "price": 49.385601
    }
]